---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplayBackground
source: html/897b41d2-9b42-2bab-a82e-0b545229d692.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground

Set of values that control how background is drawn in a view.
 Background can only be set for a 3d view or for a section or elevation view.

## Syntax (C#)
```csharp
public class ViewDisplayBackground : IDisposable
```